{
  "name": "Gabriella Gugliotta's Portfolio",
  "headerTaglineOne": "Hello 👾👋",
  "headerTaglineTwo": "I'm Gabriella - an agile",
  "headerTaglineThree": "full-stack developer",
  "headerTaglineFour": " based in Chicago, USA.",
  "showCursor": true,
  "showBlog": true,
  "darkMode": true,
  "showResume": true,
  "socials": [
    { "id": "1", "title": "Github", "link": "https://github.com/ggugliotta" },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/gabriellagugliotta"
    },
    {
      "id": "4",
      "title": "Blog",
      "link": "https://blog.gabriellagugliotta.com/"
    },
    {
      "id": "5",
      "title": "Email",
      "link": "mailto:gabriellagugliotta1@gmail.com"
    },
    { "id": "6", "title": "X", "link": "www.twitter.com/codingcoolcat" },
    {
      "id": "7",
      "title": "Medium",
      "link": "www.medium.com/gabriella_the_codingcoolcat"
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "VibeVenture",
      "description": "A Progressive Web Application for finding local events",
      "imageSrc": "https://github.com/ggugliotta/VibeVenture/raw/Main-VibeVenture/public/logo.png",
      "url": "https://ggugliotta.github.io/VibeVenture/"
    },
    {
      "id": "2",
      "title": "Flickette - React Version",
      "description": "SPA responsive movie app",
      "imageSrc": "https://github.com/ggugliotta/myFlix-client/raw/main/Flickette%20Logo%20.png",
      "url": "https://flickette.netlify.app"
    },
    {
      "id": "3",
      "title": "Flickette - Angular Version",
      "description": "SPA responsive movie app",
      "imageSrc": "https://github.com/ggugliotta/myFlix-Angular-client/raw/master/Flickette%20Logo%20.png",
      "url": "https://ggugliotta.github.io/myFlix-Angular-client/"
    },
    {
      "id": "4",
      "title": "Zing Ping",
      "description": "Chat App created in ReactNative, Expo, Andriod SDK, Gifted Chat and Google Firebase",
      "imageSrc": "https://github.com/ggugliotta/Chat-App/raw/main/ZingPing.png",
      "url": "https://github.com/ggugliotta/Chat-App"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Front-End Development ",
      "description": "User Interface (UI) Design: visually appealing and user-friendly interfaces using HTML, CSS, and JavaScript frameworks.\nResponsive Web Design: Creating websites that seamlessly adapt to various devices and screen sizes.\nInteractive Elements: Implementing dynamic features and interactive elements to enhance user experience.\nFront-end Frameworks: Proficiency in using frameworks React and Angular for efficient development.\nCross-Browser Compatibility: Ensuring websites function consistently across different web browsers."
    },
    {
      "id": "2",
      "title": "Back-end Development ",
      "description": "Server-Side Languages: Expertise inNode.js and JavaScript for server-side programming.\nDatabase Management: Designing, implementing, and managing databases using SQL or NoSQL technologies.\nAPI Development: Creating robust Application Programming Interfaces (APIs) for data exchange between different software systems.\nServer Management: Configuring and maintaining servers, ensuring optimal performance and security.\nAuthentication and Security: Implementing secure user authentication and data protection measures."
    },
    {
      "id": "3",
      "title": "Full-Stack Development",
      "description": "End-to-End Web Development: Handling the entire web development process from front-end to back-end, ensuring seamless integration and functionality.\nProject Management: Overseeing the entire development lifecycle, managing timelines, resources, and client communication.\nTroubleshooting and Maintenance: Providing ongoing support, maintenance, and troubleshooting for websites and web applications.\nIntegration of Third-Party Services: Incorporating external services and APIs to enhance website functionality."
    },
    {
      "id": "4",
      "title": "Additional Services",
      "description": "Content Management Systems (CMS): Proficiency in working with platforms like WordPress for content-driven websites and HubSpot, Google Analytics for website analysis.\nTesting and Quality Assurance: Conducting tests to ensure high performance, usability, and security of websites and applications.\nAgile Development Methodologies: Implementing agile methodologies for efficient and collaborative project development."
    }
  ],
  "aboutpara": "Welcome to my portfolio website! I am a computer programmer with a seasoned background in qualitative and quantitative data analysis. My passion for contributing to meaningful change drives my purpose in life and work. In addition, I am a huge advocate for life-long learning and enjoy delving into new challenges. Right now, I am tackling driving manual, weightlifting, and coding in Python!\n\n Interested in connecting? Message me on LinkedIn or send me an email at gabriellagugliotta96@gmail.com. \n",
  "resume": {
    "tagline": "👋  I'm a full-stack computer programmer",
    "description": "Well-versed with Javascript, MERN stack, Web Accessibility, and most web frameworks. I am fluent in English and proficient in reading/writing/conversing in Spanish.",
    "experiences": [
      {
        "id": "1",
        "dates": "March 2022 - January 2023",
        "type": "Full Time",
        "position": "Community Events & Engagement Specialist | Women In Research ",
        "bullets": "Managed social media channels with over 20k followers, Grew social media membership by over 33% through coordinated outreach efforts,  Posted over 2k social media updates, Quantified social growth through monthly and quarterly metrics reports, Administrator for Women In Research Slack channels, Compiled CRM data for membership retention and corporate donor support, Presented results on the 2022 WIRe Gender and Career Equity study; consulted on five-year action plan to improve equity within the industry to Board Members, Managed live events such as Pre-Conference Dinners and Lunch & Learns"
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
        "dates": "February 2021 - December 2021",
        "type": "Full Time",
        "position": "Administrative Assistant II | Iowa State University ",
        "bullets": "Coordinated Department Chair’s meetings and managed calendar, Managed requests for grant funding / key access / conference funding / IT service / software and business licensing, Executed quarterly Executive Advisory Council meetings, Completed data analysis for 2023 Department Accreditation and 2021 Promotion and Tenure, Trained and managed four student assistants, Organized and led visits of donors and stakeholders, Accepted into the 2021 Iowa State Cardinal Women Program"
      },
      {
        "id": "a3a01934-1e0e-43d4-856d-0d053169a4bf",
        "dates": "October 2018 - April 2020",
        "type": "Full Time",
        "position": "Market Research Specialist | Federal Signal ",
        "bullets": "Acted as an internal consultant by executing Customer Experience Improvement Campaigns for multi-billion dollar corporation, Created Business Models for proposed new ventures and offerings for various subsidiaries such as Elgin Sweeper Company, Worked with subsidiaries and Innovation Lab on special projects to improve market share and presented findings to C-Suite, Gathered market intelligence through interviewing primary stakeholders in North America, Utilized Design Thinking Methodology to execute research, Collaborated with engineers during “Ideation Sessions” regarding equipment expansion ideas, Analyzed qualitative and quantitative data for business ventures and earnings, Led competitive analysis and identified market trends and internal needs for website expansion project"
      }
    ],
    "education": {
      "universityName": "Drake University ",
      "universityDate": "2014 - 2018",
      "universityPara": "Bachelor of Arts in Law, Politics, and Society; Concentration in Leadership Studies "
    },
    "languages": ["Javascript", "HTML5", "CSS/SCSS", "TypeScript"],
    "frameworks": ["React", "NodeJs", "Bootstrap", "jQuery"],
    "deployment": ["AWS", "Heroku", "Netlify", "GitHub Pages"],
    "others": [
      "MongoDB",
      "Express.js",
      "JavaScript Syntax Extension (JSX/JavaScript XML)",
      "Test Driven Development (TDD)",
      "Recharts ",
      "Atatus ",
      "Jest",
      "Cucumber ",
      "Puppeteer",
      "JS Popper",
      "Babel",
      "Git/GitHub",
      "Postgresql",
      "Postman"
    ]
  }
}
