{
  "name": "Gabriella Gugliotta's Portfolio",
  "headerTaglineOne": "Hello 👾👋",
  "headerTaglineTwo": "I'm Gabriella - an agile",
  "headerTaglineThree": "full-stack developer",
  "headerTaglineFour": " based in Chicago, USA.",
  "showCursor": true,
  "showBlog": true,
  "darkMode": true,
  "showResume": true,
  "socials": [
    { "id": "1", "title": "Github", "link": "https://github.com/ggugliotta" },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/gabriellagugliotta"
    },
    {
      "id": "4",
      "title": "Blog",
      "link": "https://blog.gabriellagugliotta.com/"
    },
    {
      "id": "5",
      "title": "Email",
      "link": "mailto:gabriellagugliotta1@gmail.com"
    },
    {
      "id": "6",
      "title": "X",
      "link": "https://www.twitter.com/CodingCoolCat"
    },
    {
      "id": "7",
      "title": "Medium",
      "link": "https://www.medium.com/@gabriella_the_codingcoolcat"
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "VibeVenture - Event Locator Progressive Web Application",
      "description": "Front-end: React, JS, Recharts & hosted on GitHub pages. Back-end: React, JS, Node.js, Express.js (Lambda functions) and hosted on Amazon Web Services.",
      "imageSrc": "https://github.com/ggugliotta/VibeVenture/raw/Main-VibeVenture/public/logo.png",
      "url": "https://ggugliotta.github.io/VibeVenture/"
    },
    {
      "id": "2",
      "title": "Zing Ping",
      "description": "Chat App created in ReactNative, Expo, Andriod SDK, Gifted Chat and Google Firebase. Can be used on both iOS and Android devices.",
      "imageSrc": "https://github.com/ggugliotta/Chat-App/raw/main/ZingPing.png",
      "url": "https://github.com/ggugliotta/Chat-App"
    },
    {
      "id": "3",
      "title": "Flickette Movie App - React Version",
      "description": "SPA responsive front-end app with routing, interactions, and interface views. Built in ES2015+, Javascript, and React. Utilizes render to connect with my Flickette API and netlify for front-end hosting.",
      "imageSrc": "https://github.com/ggugliotta/myFlix-client/raw/main/Flickette%20Movie%20View%20Screenshot.png",
      "url": "https://flickette.netlify.app"
    },
    {
      "id": "4",
      "title": "Flickette Movie App - Angular Version",
      "description": "SPA responsive movie app generated with Angular CLI version 17.0.7. Utilizes routing, interactions, and interface views. Built with Typescript in Angular. Utilizes render to connect with my API and ghpages for front-end hosting.",
      "imageSrc": "https://github.com/ggugliotta/myFlix-Angular-client/raw/master/Flickette%20Sign%20in%20Page.png",
      "url": "https://github.com/ggugliotta/myFlix-Angular-client"
    },
    {
      "id": "5",
      "title": "Flickette Movie API",
      "description": "Backend application API utilizing MongoDB, Express.js, React.js, Bootstrap, Redux and Node.js",
      "imageSrc": "https://github.com/ggugliotta/myFlix-Angular-client/raw/master/Flickette%20Logo%20.png",
      "url": "https://github.com/ggugliotta/movie-app"
    },
    {
      "id": "6",
      "title": "Pokemon App",
      "description": "Built with HTML, CSS, Javascript, JQuery, and Bootstrap that loads external API data to display Pokemon characters and their details",
      "imageSrc": "https://github.com/ggugliotta/Pokemon-App/blob/master/Homepage%20Screenshot.png",
      "url": "https://ggugliotta.github.io/Pokemon-App/"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Front-End Development ",
      "description": "User Interface (UI) Design: visually appealing and user-friendly interfaces using HTML, CSS, and JavaScript frameworks.\nResponsive Web Design: Creating websites that seamlessly adapt to various devices and screen sizes.\nInteractive Elements: Implementing dynamic features and interactive elements to enhance user experience.\nFront-end Frameworks: Proficiency in using frameworks React and Angular for efficient development.\nCross-Browser Compatibility: Ensuring websites function consistently across different web browsers."
    },
    {
      "id": "2",
      "title": "Back-End Development ",
      "description": "Server-Side Languages: Expertise inNode.js and JavaScript for server-side programming.\nDatabase Management: Designing, implementing, and managing databases using SQL or NoSQL technologies.\nAPI Development: Creating robust Application Programming Interfaces (APIs) for data exchange between different software systems.\nServer Management: Configuring and maintaining servers, ensuring optimal performance and security.\nAuthentication and Security: Implementing secure user authentication and data protection measures."
    },
    {
      "id": "3",
      "title": "Full-Stack Development",
      "description": "End-to-End Web Development: Handling the entire web development process from front-end to back-end, ensuring seamless integration and functionality.\nProject Management: Overseeing the entire development lifecycle, managing timelines, resources, and client communication.\nTroubleshooting and Maintenance: Providing ongoing support, maintenance, and troubleshooting for websites and web applications.\nIntegration of Third-Party Services: Incorporating external services and APIs to enhance website functionality."
    },
    {
      "id": "4",
      "title": "Additional Services",
      "description": "Content Management Systems (CMS): Proficiency in working with platforms like WordPress for content-driven websites and HubSpot, Google Analytics for website analysis.\nTesting and Quality Assurance: Conducting tests to ensure high performance, usability, and security of websites and applications.\nAgile Development Methodologies: Implementing agile methodologies for efficient and collaborative project development."
    }
  ],
  "aboutpara": "Welcome to my portfolio website! I am a web developer dedicated to crafting user-friendly and accesible web applications that address real-world challenges. Let's connect and explore how my skills and experience can contribute to your team's success. \n",
  "resume": {
    "tagline": "From Pixels to Databases: Creating Holistic Web Solutions",
    "description": "I am a full-stack web developer with a passion for creating user-friendly and accessible web applications. I have a strong foundation in front-end and back-end development, and I am skilled in using a variety of programming languages, frameworks, and tools. I am dedicated to delivering high-quality, responsive, and interactive web solutions that meet the unique needs of clients and users.",
    "experiences": [
      {
        "id": "1",
        "dates": "March 2022 - January 2023",
        "type": "Full Time",
        "position": "Community Events & Engagement Specialist | Women In Research ",
        "bullets": "Managed social media channels and increased membership by over 33% ,  Posted over 2k social media updates on industry news and fundraising efforts, Presented results on the 2022 WIRe Gender and Career Equity study; consulted on five-year action plan to improve equity within the industry to board members"
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
        "dates": "February 2021 - December 2021",
        "type": "Full Time",
        "position": "Administrative Assistant II | Iowa State University ",
        "bullets": "Coordinated Department Chair’s meetings and managed calendar, Conducted research and data analysis for Department's accreditation, Onboarded and managed four student assistants"
      },
      {
        "id": "a3a01934-1e0e-43d4-856d-0d053169a4bf",
        "dates": "October 2018 - April 2020",
        "type": "Full Time",
        "position": "Market Research Specialist | Federal Signal ",
        "bullets": "Executed Customer Experience Improvement Campaigns for multi-billion dollar corporation, Created Business Models for proposed new ventures and offerings, Led Competitive Analysis and identified market trends and internal needs for website expansion project"
      }
    ],
    "certification": {
      "name": "CareerFoundry",
      "date": "2022-2024",
      "certificate": "Full-Stack Web Development",
      "description": "A self-paced, online program that covers the entire web development process, from front-end to back-end, and provides hands-on experience with industry-standard tools, libraries, and frameworks. The program includes a comprehensive curriculum, real-world projects, and mentorship from experienced developers."
    },
    "education": {
      "universityName": "Drake University ",
      "universityDate": "2014 - 2018",
      "universityPara": "Bachelor of Arts in Law, Politics, and Society; Concentration in Leadership Studies ",
      "universityGPA": "3.8",
      "universityAwards": "Dean's List, 2014-2018, Presidential Scholarship Recipient, 2014-2018",
      "universityActivities": "STEM Mentor - Des Moines Public Schools, Community Action Board - President, Service-Learning Ambassador, Big Brothers Big Sisters Mentor, Habitat for Humanity Volunteer, ",
      "honors": "Newman Civic Fellowship - Nationwide Award granted by Iowa Campus Compact and Drake University President"
    },
    "languages": ["Javascript", "HTML5", "CSS/SCSS", "TypeScript"],
    "frameworks": ["React", "Angular"],
    "deployment": ["Heroku", "Netlify", "GitHub Pages", "Expo"],
    "others": [
      "Agile Development",
      "Amazon Web Services (AWS)",
      "Application Programming Interfaces (APIs)",
      "Atatus",
      "Babel",
      "Bootstrap",
      "Cucumber",
      "Cross-Browser Testing and Debugging",
      "Data Visualization Library (Recharts)",
      "Express.js",
      "Git/GitHub",
      "Gifted Chat",
      "Google Analytics",
      "Google Firebase",
      "Functional Programming",
      "JavaScript Syntax Extension (JSX/JavaScript XML)",
      "Jest",
      "JS Popper",
      "jQuery",
      "MongoDB",
      "Node.js",
      "Object-Oriented Programming",
      "Operational Data Management Systems",
      "Postgresql",
      "Postman",
      "Puppeteer",
      "Redux",
      "Responsive Web Design",
      "SQL",
      "Test Driven Development (unit, integration, acceptance, and end-to-end testing)",
      "Web Accessibility",
      "Webpack"
    ]
  }
}
